#!/usr/bin/env python3
import os
import shutil
import json


def create_web_version():
    """Создание веб-версии УВМ"""
    print("🌐 Создание веб-версии УВМ...")

    # Создаем папку для веб-версии
    web_dir = 'web_version'
    os.makedirs(web_dir, exist_ok=True)

    # Копируем HTML файл
    shutil.copy2('web_uvm.html', os.path.join(web_dir, 'index.html'))

    # Создаем README для веб-версии
    readme_content = """# Веб-версия Учебной Виртуальной Машины

## Использование

Просто откройте файл `index.html` в браузере.

## Возможности

- Полный интерпретатор УВМ на JavaScript
- Редактор кода с подсветкой синтаксиса
- Вывод выполнения в реальном времени
- Таблица памяти с просмотром значений
- Визуализация стека
- Примеры программ

## Поддерживаемые команды

1. `LOAD_CONST <value>` - загрузка константы
2. `READ_MEM <address>` - чтение из памяти
3. `WRITE_MEM <address>` - запись в память
4. `SGN <address>` - вычисление знака

## Запуск

1. Откройте `index.html` в любом современном браузере
2. Напишите или выберите пример программы
3. Нажмите "Выполнить"
4. Смотрите результат во вкладках вывода

## Тестирование

Включены примеры программ для тестирования всех возможностей УВМ.
"""

    with open(os.path.join(web_dir, 'README.md'), 'w', encoding='utf-8') as f:
        f.write(readme_content)

    # Создаем package.json для возможности деплоя
    package_json = {
        "name": "uvm-web",
        "version": "1.0.0",
        "description": "Веб-версия Учебной Виртуальной Машины",
        "main": "index.html",
        "scripts": {
            "start": "echo 'Откройте index.html в браузере'"
        },
        "author": "UVM Project",
        "license": "MIT"
    }

    with open(os.path.join(web_dir, 'package.json'), 'w', encoding='utf-8') as f:
        json.dump(package_json, f, indent=2, ensure_ascii=False)

    print(f"✅ Веб-версия создана в папке: {web_dir}")
    print(f"📁 Откройте файл: {web_dir}/index.html в браузере")
    print("\n📋 Для деплоя на GitHub Pages:")
    print("   1. Создайте репозиторий на GitHub")
    print("   2. Загрузите содержимое папки web_version")
    print("   3. Включите GitHub Pages в настройках репозитория")
    print("   4. Откройте https://ваш_username.github.io/репозиторий")


if __name__ == "__main__":
    create_web_version()